{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "nb_filter": 32, "border_mode": "valid", "batch_input_shape": [null, 3, 20, 20], "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "b_constraint": null, "activation": "linear", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "W_constraint": null, "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "tanh"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "nb_filter": 64, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "tanh"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "activity_regularizer": null, "activation": "linear", "output_dim": 128, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "activity_regularizer": null, "activation": "linear", "output_dim": 10, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "input_dim": null}}]}
