{"config": {"name": "model_8", "output_layers": [["reshape_12", 0, 0]], "input_layers": [["input_img", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_img", "config": {"batch_input_shape": [null, 3, 20, 20], "name": "input_img", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_img", 0, 0]]], "name": "convolution2d_13", "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "nb_filter": 32, "nb_row": 3, "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "trainable": true, "name": "convolution2d_13", "activation": "linear"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "activation_22", "config": {"name": "activation_22", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_22", 0, 0]]], "name": "maxpooling2d_13", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_13", "trainable": true, "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_13", 0, 0]]], "name": "convolution2d_14", "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "nb_filter": 64, "nb_row": 3, "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "trainable": true, "name": "convolution2d_14", "activation": "linear"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "activation_23", "config": {"name": "activation_23", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_23", 0, 0]]], "name": "maxpooling2d_14", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_14", "trainable": true, "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_14", 0, 0]]], "name": "dropout_13", "config": {"name": "dropout_13", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_13", 0, 0]]], "name": "flatten_10", "config": {"name": "flatten_10", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_10", 0, 0]]], "name": "dense_13", "config": {"b_regularizer": null, "output_dim": 128, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_13", "activation": "linear"}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_13", 0, 0]]], "name": "activation_24", "config": {"name": "activation_24", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_24", 0, 0]]], "name": "dropout_14", "config": {"name": "dropout_14", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_14", 0, 0]]], "name": "dense_14", "config": {"b_regularizer": null, "output_dim": 400, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_14", "activation": "linear"}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_14", 0, 0]]], "name": "activation_25", "config": {"name": "activation_25", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_25", 0, 0]]], "name": "reshape_10", "config": {"target_shape": [20, 20], "name": "reshape_10", "trainable": true}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_10", 0, 0]]], "name": "flatten_11", "config": {"name": "flatten_11", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_11", 0, 0]]], "name": "repeatvector_4", "config": {"name": "repeatvector_4", "trainable": true, "n": 3}, "class_name": "RepeatVector"}, {"inbound_nodes": [[["repeatvector_4", 0, 0]]], "name": "reshape_11", "config": {"target_shape": [3, 20, 20], "name": "reshape_11", "trainable": true}, "class_name": "Reshape"}, {"inbound_nodes": [[["input_img", 0, 0], ["reshape_11", 0, 0]]], "name": "merge_4", "config": {"dot_axes": [-1, -1], "output_shape": null, "concat_axis": -1, "mode_type": "raw", "name": "merge_4", "output_shape_type": "raw", "mode": "mul"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_4", 0, 0]]], "name": "model_7", "config": {"input_layers": [["input_img", 0, 0]], "output_layers": [["flatten_12", 0, 0]], "name": "model_7", "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 3, 20, 20], "name": "input_img", "input_dtype": "float32"}, "name": "input_img", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_img", 0, 0]]], "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 32, "nb_col": 3, "dim_ordering": "th", "nb_row": 3, "trainable": true, "name": "convolution2d_15", "activation": "linear"}, "name": "convolution2d_15", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_15", 0, 0]]], "config": {"name": "activation_26", "trainable": true, "activation": "tanh"}, "name": "activation_26", "class_name": "Activation"}, {"inbound_nodes": [[["activation_26", 0, 0]]], "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_15", "trainable": true, "dim_ordering": "th"}, "name": "maxpooling2d_15", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_15", 0, 0]]], "config": {"W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "dim_ordering": "th", "nb_row": 3, "trainable": true, "name": "convolution2d_16", "activation": "linear"}, "name": "convolution2d_16", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_16", 0, 0]]], "config": {"name": "activation_27", "trainable": true, "activation": "tanh"}, "name": "activation_27", "class_name": "Activation"}, {"inbound_nodes": [[["activation_27", 0, 0]]], "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_16", "trainable": true, "dim_ordering": "th"}, "name": "maxpooling2d_16", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_16", 0, 0]]], "config": {"name": "dropout_15", "trainable": true, "p": 0.25}, "name": "dropout_15", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_15", 0, 0]]], "config": {"name": "flatten_12", "trainable": true}, "name": "flatten_12", "class_name": "Flatten"}]}, "class_name": "Model"}, {"inbound_nodes": [[["model_7", 1, 0]]], "name": "dense_15", "config": {"b_regularizer": null, "output_dim": 128, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_15", "activation": "linear"}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_15", 0, 0]]], "name": "activation_28", "config": {"name": "activation_28", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_28", 0, 0]]], "name": "dropout_16", "config": {"name": "dropout_16", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_16", 0, 0]]], "name": "dense_16", "config": {"b_regularizer": null, "output_dim": 10, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "name": "dense_16", "activation": "linear"}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_16", 0, 0]]], "name": "reshape_12", "config": {"target_shape": [5, 2], "name": "reshape_12", "trainable": true}, "class_name": "Reshape"}]}, "class_name": "Model"}
