{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_img", "config": {"input_dtype": "float32", "name": "input_img", "batch_input_shape": [null, 3, 20, 20]}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"nb_row": 3, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_col": 3, "nb_filter": 32, "dim_ordering": "th", "b_regularizer": null, "name": "convolution2d_7", "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["input_img", 0, 0]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"activation": "tanh", "name": "activation_13", "trainable": true}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_7", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_7", "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["activation_13", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"nb_row": 3, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "nb_col": 3, "nb_filter": 64, "dim_ordering": "th", "b_regularizer": null, "name": "convolution2d_8", "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["maxpooling2d_7", 0, 0]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"activation": "tanh", "name": "activation_14", "trainable": true}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_8", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_8", "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["activation_14", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "p": 0.25}, "inbound_nodes": [[["maxpooling2d_8", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_9", "config": {"name": "flatten_9", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"class_name": "Dense", "name": "dense_10", "config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 400, "W_regularizer": null, "activation": "linear", "name": "dense_10", "b_constraint": null, "b_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_9", 0, 0]]]}, {"class_name": "Dense", "name": "dense_11", "config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 400, "W_regularizer": null, "activation": "linear", "name": "dense_11", "b_constraint": null, "b_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_9", 0, 0]]]}, {"class_name": "Dense", "name": "dense_12", "config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 400, "W_regularizer": null, "activation": "linear", "name": "dense_12", "b_constraint": null, "b_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_9", 0, 0]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 400, "W_regularizer": null, "activation": "linear", "name": "dense_8", "b_constraint": null, "b_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_9", 0, 0]]]}, {"class_name": "Dense", "name": "dense_9", "config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 400, "W_regularizer": null, "activation": "linear", "name": "dense_9", "b_constraint": null, "b_regularizer": null, "trainable": true}, "inbound_nodes": [[["flatten_9", 0, 0]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"activation": "sigmoid", "name": "activation_15", "trainable": true}, "inbound_nodes": [[["dense_8", 0, 0]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"activation": "sigmoid", "name": "activation_16", "trainable": true}, "inbound_nodes": [[["dense_9", 0, 0]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"activation": "sigmoid", "name": "activation_17", "trainable": true}, "inbound_nodes": [[["dense_10", 0, 0]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"activation": "sigmoid", "name": "activation_18", "trainable": true}, "inbound_nodes": [[["dense_11", 0, 0]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"activation": "sigmoid", "name": "activation_19", "trainable": true}, "inbound_nodes": [[["dense_12", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_12", "config": {"name": "reshape_12", "trainable": true, "target_shape": [20, 20]}, "inbound_nodes": [[["activation_15", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_13", "config": {"name": "reshape_13", "trainable": true, "target_shape": [20, 20]}, "inbound_nodes": [[["activation_16", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_14", "config": {"name": "reshape_14", "trainable": true, "target_shape": [20, 20]}, "inbound_nodes": [[["activation_17", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_15", "config": {"name": "reshape_15", "trainable": true, "target_shape": [20, 20]}, "inbound_nodes": [[["activation_18", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_16", "config": {"name": "reshape_16", "trainable": true, "target_shape": [20, 20]}, "inbound_nodes": [[["activation_19", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_10", "config": {"name": "flatten_10", "trainable": true}, "inbound_nodes": [[["reshape_12", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_11", "config": {"name": "flatten_11", "trainable": true}, "inbound_nodes": [[["reshape_13", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_12", "config": {"name": "flatten_12", "trainable": true}, "inbound_nodes": [[["reshape_14", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_13", "config": {"name": "flatten_13", "trainable": true}, "inbound_nodes": [[["reshape_15", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_14", "config": {"name": "flatten_14", "trainable": true}, "inbound_nodes": [[["reshape_16", 0, 0]]]}, {"class_name": "RepeatVector", "name": "repeatvector_10", "config": {"n": 3, "name": "repeatvector_10", "trainable": true}, "inbound_nodes": [[["flatten_14", 0, 0]]]}, {"class_name": "RepeatVector", "name": "repeatvector_6", "config": {"n": 3, "name": "repeatvector_6", "trainable": true}, "inbound_nodes": [[["flatten_10", 0, 0]]]}, {"class_name": "RepeatVector", "name": "repeatvector_7", "config": {"n": 3, "name": "repeatvector_7", "trainable": true}, "inbound_nodes": [[["flatten_11", 0, 0]]]}, {"class_name": "RepeatVector", "name": "repeatvector_8", "config": {"n": 3, "name": "repeatvector_8", "trainable": true}, "inbound_nodes": [[["flatten_12", 0, 0]]]}, {"class_name": "RepeatVector", "name": "repeatvector_9", "config": {"n": 3, "name": "repeatvector_9", "trainable": true}, "inbound_nodes": [[["flatten_13", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_17", "config": {"name": "reshape_17", "trainable": true, "target_shape": [3, 20, 20]}, "inbound_nodes": [[["repeatvector_6", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_18", "config": {"name": "reshape_18", "trainable": true, "target_shape": [3, 20, 20]}, "inbound_nodes": [[["repeatvector_7", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_19", "config": {"name": "reshape_19", "trainable": true, "target_shape": [3, 20, 20]}, "inbound_nodes": [[["repeatvector_8", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_20", "config": {"name": "reshape_20", "trainable": true, "target_shape": [3, 20, 20]}, "inbound_nodes": [[["repeatvector_9", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_21", "config": {"name": "reshape_21", "trainable": true, "target_shape": [3, 20, 20]}, "inbound_nodes": [[["repeatvector_10", 0, 0]]]}, {"class_name": "Merge", "name": "merge_10", "config": {"mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_10", "mode": "mul", "concat_axis": -1}, "inbound_nodes": [[["input_img", 0, 0], ["reshape_20", 0, 0]]]}, {"class_name": "Merge", "name": "merge_11", "config": {"mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_11", "mode": "mul", "concat_axis": -1}, "inbound_nodes": [[["input_img", 0, 0], ["reshape_21", 0, 0]]]}, {"class_name": "Merge", "name": "merge_7", "config": {"mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_7", "mode": "mul", "concat_axis": -1}, "inbound_nodes": [[["input_img", 0, 0], ["reshape_17", 0, 0]]]}, {"class_name": "Merge", "name": "merge_8", "config": {"mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_8", "mode": "mul", "concat_axis": -1}, "inbound_nodes": [[["input_img", 0, 0], ["reshape_18", 0, 0]]]}, {"class_name": "Merge", "name": "merge_9", "config": {"mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_9", "mode": "mul", "concat_axis": -1}, "inbound_nodes": [[["input_img", 0, 0], ["reshape_19", 0, 0]]]}, {"class_name": "Model", "name": "model_3", "config": {"layers": [{"class_name": "InputLayer", "name": "input_img", "config": {"input_dtype": "float32", "name": "input_img", "batch_input_shape": [null, 3, 20, 20]}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"nb_row": 3, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_col": 3, "nb_filter": 32, "dim_ordering": "th", "name": "convolution2d_5", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["input_img", 0, 0]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"activation": "tanh", "name": "activation_11", "trainable": true}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_5", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_5", "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["activation_11", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"nb_row": 3, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "activation": "linear", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_col": 3, "nb_filter": 64, "dim_ordering": "th", "name": "convolution2d_6", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["maxpooling2d_5", 0, 0]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"activation": "tanh", "name": "activation_12", "trainable": true}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_6", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_6", "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["activation_12", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "p": 0.25}, "inbound_nodes": [[["maxpooling2d_6", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_8", "config": {"name": "flatten_8", "trainable": true}, "inbound_nodes": [[["dropout_4", 0, 0]]]}], "output_layers": [["flatten_8", 0, 0]], "name": "model_3", "input_layers": [["input_img", 0, 0]]}, "inbound_nodes": [[["merge_7", 0, 0]], [["merge_8", 0, 0]], [["merge_9", 0, 0]], [["merge_10", 0, 0]], [["merge_11", 0, 0]]]}, {"class_name": "Merge", "name": "merge_12", "config": {"mode_type": "raw", "output_shape_type": "raw", "output_shape": null, "dot_axes": [-1, -1], "name": "merge_12", "mode": "concat", "concat_axis": -1}, "inbound_nodes": [[["model_3", 1, 0], ["model_3", 2, 0], ["model_3", 3, 0], ["model_3", 4, 0], ["model_3", 5, 0]]]}, {"class_name": "Dense", "name": "dense_13", "config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 128, "W_regularizer": null, "activation": "linear", "name": "dense_13", "b_constraint": null, "b_regularizer": null, "trainable": true}, "inbound_nodes": [[["merge_12", 0, 0]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"activation": "tanh", "name": "activation_20", "trainable": true}, "inbound_nodes": [[["dense_13", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "inbound_nodes": [[["activation_20", 0, 0]]]}, {"class_name": "Dense", "name": "dense_14", "config": {"W_constraint": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "output_dim": 10, "W_regularizer": null, "activation": "linear", "name": "dense_14", "b_constraint": null, "b_regularizer": null, "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0]]]}, {"class_name": "Reshape", "name": "reshape_22", "config": {"name": "reshape_22", "trainable": true, "target_shape": [5, 2]}, "inbound_nodes": [[["dense_14", 0, 0]]]}], "output_layers": [["reshape_22", 0, 0]], "name": "model_4", "input_layers": [["input_img", 0, 0]]}}
