{"config": [{"config": {"batch_input_shape": [null, 3, 20, 20], "nb_filter": 32, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_17", "W_constraint": null, "activation": "linear", "input_dtype": "float32", "dim_ordering": "th", "nb_row": 3, "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_25"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_14"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 64, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "dim_ordering": "th", "name": "convolution2d_18", "W_constraint": null, "activation": "linear", "border_mode": "valid", "nb_row": 3, "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_26"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_15"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.25, "name": "dropout_17"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_9"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "input_dim": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "output_dim": 128, "activation": "linear", "name": "dense_17"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_27"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_18"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "input_dim": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "output_dim": 6, "activation": "linear", "name": "dense_18"}, "class_name": "Dense"}, {"config": {"trainable": true, "target_shape": [3, 2], "name": "reshape_8"}, "class_name": "Reshape"}], "class_name": "Sequential"}
