{"config": {"layers": [{"config": {"batch_input_shape": [null, 3, 20, 20], "input_dtype": "float32", "name": "input_img"}, "class_name": "InputLayer", "name": "input_img", "inbound_nodes": []}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "valid", "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "name": "convolution2d_13"}, "class_name": "Convolution2D", "name": "convolution2d_13", "inbound_nodes": [[["input_img", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "valid", "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "name": "convolution2d_15"}, "class_name": "Convolution2D", "name": "convolution2d_15", "inbound_nodes": [[["input_img", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "valid", "dim_ordering": "th", "nb_filter": 32, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "name": "convolution2d_17"}, "class_name": "Convolution2D", "name": "convolution2d_17", "inbound_nodes": [[["input_img", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_19", "trainable": true}, "class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_22", "trainable": true}, "class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_25", "trainable": true}, "class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_13", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_13", "inbound_nodes": [[["activation_19", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_15", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_15", "inbound_nodes": [[["activation_22", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_17", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_17", "inbound_nodes": [[["activation_25", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "valid", "dim_ordering": "th", "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "name": "convolution2d_14"}, "class_name": "Convolution2D", "name": "convolution2d_14", "inbound_nodes": [[["maxpooling2d_13", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "valid", "dim_ordering": "th", "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "name": "convolution2d_16"}, "class_name": "Convolution2D", "name": "convolution2d_16", "inbound_nodes": [[["maxpooling2d_15", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "valid", "dim_ordering": "th", "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "W_regularizer": null, "name": "convolution2d_18"}, "class_name": "Convolution2D", "name": "convolution2d_18", "inbound_nodes": [[["maxpooling2d_17", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_20", "trainable": true}, "class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_23", "trainable": true}, "class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_26", "trainable": true}, "class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_14", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_14", "inbound_nodes": [[["activation_20", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_16", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_16", "inbound_nodes": [[["activation_23", 0, 0]]]}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_18", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "maxpooling2d_18", "inbound_nodes": [[["activation_26", 0, 0]]]}, {"config": {"p": 0.25, "name": "dropout_13", "trainable": true}, "class_name": "Dropout", "name": "dropout_13", "inbound_nodes": [[["maxpooling2d_14", 0, 0]]]}, {"config": {"p": 0.25, "name": "dropout_15", "trainable": true}, "class_name": "Dropout", "name": "dropout_15", "inbound_nodes": [[["maxpooling2d_16", 0, 0]]]}, {"config": {"p": 0.25, "name": "dropout_17", "trainable": true}, "class_name": "Dropout", "name": "dropout_17", "inbound_nodes": [[["maxpooling2d_18", 0, 0]]]}, {"config": {"name": "flatten_7", "trainable": true}, "class_name": "Flatten", "name": "flatten_7", "inbound_nodes": [[["dropout_13", 0, 0]]]}, {"config": {"name": "flatten_8", "trainable": true}, "class_name": "Flatten", "name": "flatten_8", "inbound_nodes": [[["dropout_15", 0, 0]]]}, {"config": {"name": "flatten_9", "trainable": true}, "class_name": "Flatten", "name": "flatten_9", "inbound_nodes": [[["dropout_17", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_15", "activity_regularizer": null, "W_regularizer": null, "output_dim": 128, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "trainable": true}, "class_name": "Dense", "name": "dense_15", "inbound_nodes": [[["flatten_7", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_17", "activity_regularizer": null, "W_regularizer": null, "output_dim": 128, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "trainable": true}, "class_name": "Dense", "name": "dense_17", "inbound_nodes": [[["flatten_8", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_19", "activity_regularizer": null, "W_regularizer": null, "output_dim": 128, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "trainable": true}, "class_name": "Dense", "name": "dense_19", "inbound_nodes": [[["flatten_9", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_21", "trainable": true}, "class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["dense_15", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_24", "trainable": true}, "class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["dense_17", 0, 0]]]}, {"config": {"activation": "tanh", "name": "activation_27", "trainable": true}, "class_name": "Activation", "name": "activation_27", "inbound_nodes": [[["dense_19", 0, 0]]]}, {"config": {"p": 0.5, "name": "dropout_14", "trainable": true}, "class_name": "Dropout", "name": "dropout_14", "inbound_nodes": [[["activation_21", 0, 0]]]}, {"config": {"p": 0.5, "name": "dropout_16", "trainable": true}, "class_name": "Dropout", "name": "dropout_16", "inbound_nodes": [[["activation_24", 0, 0]]]}, {"config": {"p": 0.5, "name": "dropout_18", "trainable": true}, "class_name": "Dropout", "name": "dropout_18", "inbound_nodes": [[["activation_27", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_16", "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "trainable": true}, "class_name": "Dense", "name": "dense_16", "inbound_nodes": [[["dropout_14", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_18", "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "trainable": true}, "class_name": "Dense", "name": "dense_18", "inbound_nodes": [[["dropout_16", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_20", "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "trainable": true}, "class_name": "Dense", "name": "dense_20", "inbound_nodes": [[["dropout_18", 0, 0]]]}, {"config": {"concat_axis": -1, "mode_type": "raw", "output_shape_type": "raw", "mode": "concat", "output_shape": null, "name": "merge_3", "dot_axes": [-1, -1]}, "class_name": "Merge", "name": "merge_3", "inbound_nodes": [[["dense_16", 0, 0], ["dense_18", 0, 0], ["dense_20", 0, 0]]]}, {"config": {"b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_21", "activity_regularizer": null, "W_regularizer": null, "output_dim": 10, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "trainable": true}, "class_name": "Dense", "name": "dense_21", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"config": {"target_shape": [5, 2], "name": "reshape_3", "trainable": true}, "class_name": "Reshape", "name": "reshape_3", "inbound_nodes": [[["dense_21", 0, 0]]]}], "input_layers": [["input_img", 0, 0]], "name": "model_3", "output_layers": [["reshape_3", 0, 0]]}, "class_name": "Model"}
