{"class_name": "Model", "config": {"name": "model_4", "output_layers": [["reshape_13", 0, 0]], "layers": [{"name": "input_img", "class_name": "InputLayer", "inbound_nodes": [], "config": {"input_dtype": "float32", "batch_input_shape": [null, 3, 20, 20], "name": "input_img"}}, {"name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["input_img", 0, 0]]], "config": {"nb_filter": 32, "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_7", "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid"}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"name": "activation_11", "trainable": true, "activation": "tanh"}}, {"name": "maxpooling2d_7", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_11", 0, 0]]], "config": {"name": "maxpooling2d_7", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true}}, {"name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_7", 0, 0]]], "config": {"nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_8", "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid"}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"name": "activation_12", "trainable": true, "activation": "tanh"}}, {"name": "maxpooling2d_8", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_12", 0, 0]]], "config": {"name": "maxpooling2d_8", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true}}, {"name": "dropout_8", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_8", 0, 0]]], "config": {"name": "dropout_8", "trainable": true, "p": 0.25}}, {"name": "flatten_4", "class_name": "Flatten", "inbound_nodes": [[["dropout_8", 0, 0]]], "config": {"name": "flatten_4", "trainable": true}}, {"name": "dense_10", "class_name": "Dense", "inbound_nodes": [[["flatten_4", 0, 0]]], "config": {"name": "dense_10", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 400, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "dense_11", "class_name": "Dense", "inbound_nodes": [[["flatten_4", 0, 0]]], "config": {"name": "dense_11", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 400, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "dense_12", "class_name": "Dense", "inbound_nodes": [[["flatten_4", 0, 0]]], "config": {"name": "dense_12", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 400, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "dense_13", "class_name": "Dense", "inbound_nodes": [[["flatten_4", 0, 0]]], "config": {"name": "dense_13", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 400, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "dense_9", "class_name": "Dense", "inbound_nodes": [[["flatten_4", 0, 0]]], "config": {"name": "dense_9", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 400, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["dense_9", 0, 0]]], "config": {"name": "activation_13", "trainable": true, "activation": "sigmoid"}}, {"name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["dense_10", 0, 0]]], "config": {"name": "activation_14", "trainable": true, "activation": "sigmoid"}}, {"name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["dense_11", 0, 0]]], "config": {"name": "activation_15", "trainable": true, "activation": "sigmoid"}}, {"name": "activation_16", "class_name": "Activation", "inbound_nodes": [[["dense_12", 0, 0]]], "config": {"name": "activation_16", "trainable": true, "activation": "sigmoid"}}, {"name": "activation_17", "class_name": "Activation", "inbound_nodes": [[["dense_13", 0, 0]]], "config": {"name": "activation_17", "trainable": true, "activation": "sigmoid"}}, {"name": "reshape_3", "class_name": "Reshape", "inbound_nodes": [[["activation_13", 0, 0]]], "config": {"name": "reshape_3", "target_shape": [20, 20], "trainable": true}}, {"name": "reshape_4", "class_name": "Reshape", "inbound_nodes": [[["activation_14", 0, 0]]], "config": {"name": "reshape_4", "target_shape": [20, 20], "trainable": true}}, {"name": "reshape_5", "class_name": "Reshape", "inbound_nodes": [[["activation_15", 0, 0]]], "config": {"name": "reshape_5", "target_shape": [20, 20], "trainable": true}}, {"name": "reshape_6", "class_name": "Reshape", "inbound_nodes": [[["activation_16", 0, 0]]], "config": {"name": "reshape_6", "target_shape": [20, 20], "trainable": true}}, {"name": "reshape_7", "class_name": "Reshape", "inbound_nodes": [[["activation_17", 0, 0]]], "config": {"name": "reshape_7", "target_shape": [20, 20], "trainable": true}}, {"name": "flatten_5", "class_name": "Flatten", "inbound_nodes": [[["reshape_3", 0, 0]]], "config": {"name": "flatten_5", "trainable": true}}, {"name": "flatten_6", "class_name": "Flatten", "inbound_nodes": [[["reshape_4", 0, 0]]], "config": {"name": "flatten_6", "trainable": true}}, {"name": "flatten_7", "class_name": "Flatten", "inbound_nodes": [[["reshape_5", 0, 0]]], "config": {"name": "flatten_7", "trainable": true}}, {"name": "flatten_8", "class_name": "Flatten", "inbound_nodes": [[["reshape_6", 0, 0]]], "config": {"name": "flatten_8", "trainable": true}}, {"name": "flatten_9", "class_name": "Flatten", "inbound_nodes": [[["reshape_7", 0, 0]]], "config": {"name": "flatten_9", "trainable": true}}, {"name": "repeatvector_1", "class_name": "RepeatVector", "inbound_nodes": [[["flatten_5", 0, 0]]], "config": {"name": "repeatvector_1", "trainable": true, "n": 3}}, {"name": "repeatvector_2", "class_name": "RepeatVector", "inbound_nodes": [[["flatten_6", 0, 0]]], "config": {"name": "repeatvector_2", "trainable": true, "n": 3}}, {"name": "repeatvector_3", "class_name": "RepeatVector", "inbound_nodes": [[["flatten_7", 0, 0]]], "config": {"name": "repeatvector_3", "trainable": true, "n": 3}}, {"name": "repeatvector_4", "class_name": "RepeatVector", "inbound_nodes": [[["flatten_8", 0, 0]]], "config": {"name": "repeatvector_4", "trainable": true, "n": 3}}, {"name": "repeatvector_5", "class_name": "RepeatVector", "inbound_nodes": [[["flatten_9", 0, 0]]], "config": {"name": "repeatvector_5", "trainable": true, "n": 3}}, {"name": "reshape_10", "class_name": "Reshape", "inbound_nodes": [[["repeatvector_3", 0, 0]]], "config": {"name": "reshape_10", "target_shape": [3, 20, 20], "trainable": true}}, {"name": "reshape_11", "class_name": "Reshape", "inbound_nodes": [[["repeatvector_4", 0, 0]]], "config": {"name": "reshape_11", "target_shape": [3, 20, 20], "trainable": true}}, {"name": "reshape_12", "class_name": "Reshape", "inbound_nodes": [[["repeatvector_5", 0, 0]]], "config": {"name": "reshape_12", "target_shape": [3, 20, 20], "trainable": true}}, {"name": "reshape_8", "class_name": "Reshape", "inbound_nodes": [[["repeatvector_1", 0, 0]]], "config": {"name": "reshape_8", "target_shape": [3, 20, 20], "trainable": true}}, {"name": "reshape_9", "class_name": "Reshape", "inbound_nodes": [[["repeatvector_2", 0, 0]]], "config": {"name": "reshape_9", "target_shape": [3, 20, 20], "trainable": true}}, {"name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["input_img", 0, 0], ["reshape_8", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "dot_axes": [-1, -1], "name": "merge_1", "mode": "mul", "output_shape": null, "concat_axis": -1}}, {"name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["input_img", 0, 0], ["reshape_9", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "dot_axes": [-1, -1], "name": "merge_2", "mode": "mul", "output_shape": null, "concat_axis": -1}}, {"name": "merge_3", "class_name": "Merge", "inbound_nodes": [[["input_img", 0, 0], ["reshape_10", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "dot_axes": [-1, -1], "name": "merge_3", "mode": "mul", "output_shape": null, "concat_axis": -1}}, {"name": "merge_4", "class_name": "Merge", "inbound_nodes": [[["input_img", 0, 0], ["reshape_11", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "dot_axes": [-1, -1], "name": "merge_4", "mode": "mul", "output_shape": null, "concat_axis": -1}}, {"name": "merge_5", "class_name": "Merge", "inbound_nodes": [[["input_img", 0, 0], ["reshape_12", 0, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "dot_axes": [-1, -1], "name": "merge_5", "mode": "mul", "output_shape": null, "concat_axis": -1}}, {"name": "model_3", "class_name": "Model", "inbound_nodes": [[["merge_1", 0, 0]], [["merge_2", 0, 0]], [["merge_3", 0, 0]], [["merge_4", 0, 0]], [["merge_5", 0, 0]]], "config": {"name": "model_3", "output_layers": [["flatten_3", 0, 0]], "input_layers": [["input_img", 0, 0]], "layers": [{"name": "input_img", "class_name": "InputLayer", "inbound_nodes": [], "config": {"input_dtype": "float32", "batch_input_shape": [null, 3, 20, 20], "name": "input_img"}}, {"name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["input_img", 0, 0]]], "config": {"nb_filter": 32, "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "trainable": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_5", "activation": "linear", "border_mode": "valid"}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"name": "activation_9", "trainable": true, "activation": "tanh"}}, {"name": "maxpooling2d_5", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_9", 0, 0]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_5", "dim_ordering": "th", "trainable": true}}, {"name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_5", 0, 0]]], "config": {"nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "th", "trainable": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_6", "activation": "linear", "border_mode": "valid"}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"name": "activation_10", "trainable": true, "activation": "tanh"}}, {"name": "maxpooling2d_6", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_10", 0, 0]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_6", "dim_ordering": "th", "trainable": true}}, {"name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_6", 0, 0]]], "config": {"name": "dropout_7", "trainable": true, "p": 0.25}}, {"name": "flatten_3", "class_name": "Flatten", "inbound_nodes": [[["dropout_7", 0, 0]]], "config": {"name": "flatten_3", "trainable": true}}]}}, {"name": "merge_6", "class_name": "Merge", "inbound_nodes": [[["model_3", 1, 0], ["model_3", 2, 0], ["model_3", 3, 0], ["model_3", 4, 0], ["model_3", 5, 0]]], "config": {"mode_type": "raw", "output_shape_type": "raw", "dot_axes": [-1, -1], "name": "merge_6", "mode": "concat", "output_shape": null, "concat_axis": -1}}, {"name": "dense_14", "class_name": "Dense", "inbound_nodes": [[["merge_6", 0, 0]]], "config": {"name": "dense_14", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 128, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "activation_18", "class_name": "Activation", "inbound_nodes": [[["dense_14", 0, 0]]], "config": {"name": "activation_18", "trainable": true, "activation": "tanh"}}, {"name": "dropout_9", "class_name": "Dropout", "inbound_nodes": [[["activation_18", 0, 0]]], "config": {"name": "dropout_9", "trainable": true, "p": 0.5}}, {"name": "dense_15", "class_name": "Dense", "inbound_nodes": [[["dropout_9", 0, 0]]], "config": {"name": "dense_15", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 10, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "reshape_13", "class_name": "Reshape", "inbound_nodes": [[["dense_15", 0, 0]]], "config": {"name": "reshape_13", "target_shape": [5, 2], "trainable": true}}], "input_layers": [["input_img", 0, 0]]}}
