{"class_name": "Model", "config": {"name": "model_2", "output_layers": [["reshape_2", 0, 0]], "layers": [{"name": "input_img", "class_name": "InputLayer", "inbound_nodes": [], "config": {"input_dtype": "float32", "batch_input_shape": [null, 3, 20, 20], "name": "input_img"}}, {"name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["input_img", 0, 0]]], "config": {"nb_filter": 32, "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_3", "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid"}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"name": "activation_5", "trainable": true, "activation": "tanh"}}, {"name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0]]], "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true}}, {"name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"nb_filter": 64, "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "dim_ordering": "th", "trainable": true, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "W_constraint": null, "activation": "linear", "border_mode": "valid"}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"name": "activation_6", "trainable": true, "activation": "tanh"}}, {"name": "maxpooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_6", 0, 0]]], "config": {"name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true}}, {"name": "dropout_4", "class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "config": {"name": "dropout_4", "trainable": true, "p": 0.25}}, {"name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["dropout_4", 0, 0]]], "config": {"name": "flatten_2", "trainable": true}}, {"name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0]]], "config": {"name": "dense_5", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 128, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["dense_5", 0, 0]]], "config": {"name": "activation_7", "trainable": true, "activation": "tanh"}}, {"name": "dropout_5", "class_name": "Dropout", "inbound_nodes": [[["activation_7", 0, 0]]], "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"name": "dense_6", "class_name": "Dense", "inbound_nodes": [[["dropout_5", 0, 0]]], "config": {"name": "dense_6", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 10, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "dense_7", "class_name": "Dense", "inbound_nodes": [[["dense_6", 0, 0]]], "config": {"name": "dense_7", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 128, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["dense_7", 0, 0]]], "config": {"name": "activation_8", "trainable": true, "activation": "tanh"}}, {"name": "dropout_6", "class_name": "Dropout", "inbound_nodes": [[["activation_8", 0, 0]]], "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"name": "dense_8", "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0]]], "config": {"name": "dense_8", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "trainable": true, "output_dim": 10, "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"name": "reshape_2", "class_name": "Reshape", "inbound_nodes": [[["dense_8", 0, 0]]], "config": {"name": "reshape_2", "target_shape": [5, 2], "trainable": true}}], "input_layers": [["input_img", 0, 0]]}}
