{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "nb_col": 3, "batch_input_shape": [null, 3, 20, 20], "activation": "linear", "input_dtype": "float32", "nb_row": 3, "dim_ordering": "th", "name": "convolution2d_17", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "nb_filter": 32, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_24"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "th", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_11"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "nb_col": 3, "activation": "linear", "name": "convolution2d_18", "nb_row": 3, "dim_ordering": "th", "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_25"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "th", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_12"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_17"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_8"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 128, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense_15", "input_dim": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_26"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_18"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "output_dim": 10, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "dense_16", "input_dim": null, "W_regularizer": null}}]}
