{"config": {"output_layers": [["activation_92", 0, 0], ["activation_93", 0, 0], ["activation_94", 0, 0], ["activation_95", 0, 0], ["activation_96", 0, 0]], "name": "model_18", "layers": [{"config": {"batch_input_shape": [null, 3, 20, 20], "input_dtype": "float32", "name": "input_img"}, "name": "input_img", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "name": "convolution2d_48", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 32}, "name": "convolution2d_48", "inbound_nodes": [[["input_img", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"activation": "tanh", "name": "activation_89", "trainable": true}, "name": "activation_89", "inbound_nodes": [[["convolution2d_48", 0, 0]]], "class_name": "Activation"}, {"config": {"name": "maxpooling2d_47", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_47", "inbound_nodes": [[["activation_89", 0, 0]]], "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "name": "convolution2d_49", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "nb_filter": 64}, "name": "convolution2d_49", "inbound_nodes": [[["maxpooling2d_47", 0, 0]]], "class_name": "Convolution2D"}, {"config": {"activation": "tanh", "name": "activation_90", "trainable": true}, "name": "activation_90", "inbound_nodes": [[["convolution2d_49", 0, 0]]], "class_name": "Activation"}, {"config": {"name": "maxpooling2d_48", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_48", "inbound_nodes": [[["activation_90", 0, 0]]], "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "name": "dropout_47", "trainable": true}, "name": "dropout_47", "inbound_nodes": [[["maxpooling2d_48", 0, 0]]], "class_name": "Dropout"}, {"config": {"name": "flatten_24", "trainable": true}, "name": "flatten_24", "inbound_nodes": [[["dropout_47", 0, 0]]], "class_name": "Flatten"}, {"config": {"activation": "linear", "name": "dense_68", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 256, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null}, "name": "dense_68", "inbound_nodes": [[["flatten_24", 0, 0]]], "class_name": "Dense"}, {"config": {"activation": "tanh", "name": "activation_91", "trainable": true}, "name": "activation_91", "inbound_nodes": [[["dense_68", 0, 0]]], "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_48", "trainable": true}, "name": "dropout_48", "inbound_nodes": [[["activation_91", 0, 0]]], "class_name": "Dropout"}, {"config": {"activation": "linear", "name": "landmark-0", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 4, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null}, "name": "landmark-0", "inbound_nodes": [[["dropout_48", 0, 0]]], "class_name": "Dense"}, {"config": {"activation": "linear", "name": "landmark-1", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 4, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null}, "name": "landmark-1", "inbound_nodes": [[["dropout_48", 0, 0]]], "class_name": "Dense"}, {"config": {"activation": "linear", "name": "landmark-2", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 4, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null}, "name": "landmark-2", "inbound_nodes": [[["dropout_48", 0, 0]]], "class_name": "Dense"}, {"config": {"activation": "linear", "name": "landmark-3", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 4, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null}, "name": "landmark-3", "inbound_nodes": [[["dropout_48", 0, 0]]], "class_name": "Dense"}, {"config": {"activation": "linear", "name": "landmark-4", "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 4, "input_dim": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null}, "name": "landmark-4", "inbound_nodes": [[["dropout_48", 0, 0]]], "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_92", "trainable": true}, "name": "activation_92", "inbound_nodes": [[["landmark-0", 0, 0]]], "class_name": "Activation"}, {"config": {"activation": "sigmoid", "name": "activation_93", "trainable": true}, "name": "activation_93", "inbound_nodes": [[["landmark-1", 0, 0]]], "class_name": "Activation"}, {"config": {"activation": "sigmoid", "name": "activation_94", "trainable": true}, "name": "activation_94", "inbound_nodes": [[["landmark-2", 0, 0]]], "class_name": "Activation"}, {"config": {"activation": "sigmoid", "name": "activation_95", "trainable": true}, "name": "activation_95", "inbound_nodes": [[["landmark-3", 0, 0]]], "class_name": "Activation"}, {"config": {"activation": "sigmoid", "name": "activation_96", "trainable": true}, "name": "activation_96", "inbound_nodes": [[["landmark-4", 0, 0]]], "class_name": "Activation"}], "input_layers": [["input_img", 0, 0]]}, "class_name": "Model"}
